This is the query writing notebook. Do not modify the tables at all

In [ ]:
!pip install ipython-sql
!pip install mysqlclient

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.22)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (67.7.2)
Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.39)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.8)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: mysqlclient in /usr/local/lib/python3.10/dist-packages (2.2.0)

In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%sql mysql://A08:A08password@testproject.mysql.database.azure.com:3306/A08

In [ ]:
%sql show databases

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('a08',), ('information_schema',), ('performance_schema',)]

In [ ]:
%%sql
use a08

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

In [ ]:
%%sql
show tables

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
10 rows affected.

[('attributes_new_up',),
 ('business_new',),
 ('categories_new_up',),
 ('checkin_new_up',),
 ('elite_new_up',),
 ('hour_new_up',),
 ('tips_new_up',),
 ('users_new',),
 ('yelp_friends_new_up',),
 ('yelp_rev_new_up',)]

In [ ]:
%%sql
SELECT *
FROM users_new
limit 3;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('___6aix-XvFcQz3GauAPpw', 'John', 7, datetime.datetime(2011, 9, 26, 18, 10, 5), 30, 0, 2, 0, 2.75, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
 ('___9Jl-8aF7z58JdTWlyjw', 'Erin', 10, datetime.datetime(2011, 4, 23, 23, 47, 24), 2, 2, 2, 0, 3.9, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0),
 ('___aO4EhZULBsJPvJ4rMhA', 'David', 14, datetime.datetime(2010, 12, 4, 22, 21, 55), 20, 6, 4, 0, 1.69, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)]

In [ ]:
%%sql
SELECT *
FROM business_new
limit 2;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
2 rows affected.

[('___UdvaxCnwsQ7nA1eKZAQ', 'PHLASH', '', 'Philadelphia', 'PA', '19106', 39.9565961073, -75.1650238037, 3.5, 41, 1),
 ('__2LkeVwTuKar5AE95Idzw', "McDonald's", '11007 Bloomingdale Ave', 'Riverview', 'FL', '33569', 27.8931987958, -82.3198442906, 1.5, 13, 1)]

In [ ]:
%%sql
SELECT *
FROM tips_new_up
ORDER BY compliment_count DESC
limit 3

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[(711664, '661RwsBrt5ZbNhuipyhJcQ', 'x8-sTKZG59RUhgGj_kcyVg', 'Brandon. Come here for your bbq.  Gush.', datetime.datetime(2016, 6, 11, 15, 37, 7), 6),
 (543368, 'tsMF0FcFcHZ8i28WzWtQXw', 'dsfRniRgfbDjC8os848B6A', "Experience Bern's by sitting at the bar too . Order a delicious steak sandwich with their onion straws or order off the full menu. It's definitely delicious !", datetime.datetime(2020, 3, 5, 1, 28, 45), 6),
 (85849, 'G-l9ihg3sRAiGTuZLDmJTQ', '5AOSTPOiZb7pnHJ6ICqqbA', '$8 drink menu, Velvet seats, and Dog friendly.', datetime.datetime(2014, 11, 6, 1, 1, 18), 5)]

In [ ]:
%%sql
SELECT *
FROM attributes_new_up
limit 3;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[(1, 'ByAppointmentOnly: True', 'Pns2l4eNsfO8kk83dixA6A'),
 (2, 'BusinessAcceptsCreditCards: True', 'mpf3x-BjTdTEA3yCZrAYPw'),
 (3, 'BikeParking: True', 'tUFrWirKiKi_TAnsVWINQQ')]

In [ ]:
%%sql
SELECT *
FROM hour_new_up
limit 5;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[(1, 'Pns2l4eNsfO8kk83dixA6A', None),
 (2, 'mpf3x-BjTdTEA3yCZrAYPw', "'Monday': '0:0-0:0'"),
 (3, 'mpf3x-BjTdTEA3yCZrAYPw', " 'Tuesday': '8:0-18:30'"),
 (4, 'mpf3x-BjTdTEA3yCZrAYPw', " 'Wednesday': '8:0-18:30'"),
 (5, 'mpf3x-BjTdTEA3yCZrAYPw', " 'Thursday': '8:0-18:30'")]

In [ ]:
%%sql
SELECT *
FROM elite_new_up
limit 5;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[(1, 'qVc8ODYU5SZjKXVBgXdI7w', '2007'),
 (2, 'j14WgRoU_-2ZE1aw1dXrJg', '2009'),
 (3, 'j14WgRoU_-2ZE1aw1dXrJg', '2010'),
 (4, 'j14WgRoU_-2ZE1aw1dXrJg', '2011'),
 (5, 'j14WgRoU_-2ZE1aw1dXrJg', '2012')]

In [ ]:
%%sql
SELECT *
FROM yelp_friends_new_up
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[(1, 'qVc8ODYU5SZjKXVBgXdI7w', 'NSCy54eWehBJyZdG2iE84w'),
 (2, 'qVc8ODYU5SZjKXVBgXdI7w', ' pe42u7DcCH2QmI81NX-8qA'),
 (3, 'qVc8ODYU5SZjKXVBgXdI7w', ' EjlCGf14tYMPJ0rsrL703w'),
 (4, 'qVc8ODYU5SZjKXVBgXdI7w', ' 7OagHIAKx2Rm9z3CQ0OmvA'),
 (5, 'qVc8ODYU5SZjKXVBgXdI7w', ' uZoFvKs0dahfffIqHQf1eA')]

In [ ]:
%%sql
SELECT *
FROM yelp_rev_new_up
limit 3;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('___44iO4AFtcmV-KB4D-2w', '6wjujUMJ4win3MQM9-C0aA', 'l3Ajic1Gq-oDIXM81SPZ1A', 5.0, 0, 0, 0, "I love this salon! Thomas & Bella have done an amazing job turning it into THE place to get the best mani/pedi in Tucson. I followed my favorite nail tech, Lily, from another salon & I'm so glad I did! The atmosphere is calm & relaxing and everyone is friendly. Well worth the drive to Rita Ranch.", datetime.datetime(2020, 1, 31, 13, 20, 25)),
 ('___7mnNcwBXBN76xXXsYyw', 'gexqRmOpGM7S3XMpx1LySA', 'I2YZuyG1KjiTbtwfNFHaOQ', 5.0, 0, 0, 0, "Such great food and service ..not to mention AMAZING cause!. I would go here EVERY TIME I'm in NOLA!", datetime.datetime(2019, 8, 23, 19, 27, 18)),
 ('___881evFAzgFZxMEvHv-w', 'Nb0t9ikn5Y14d_ZtGyfF7w', 'YqSW6uIkrF9a2h6iLgRw2w', 5.0, 0, 0, 0, 'Excellent. Juicy, well-seasoned salmon. Even the mixed veggies were great. Highly recommended!', datetime.datetime(2018, 4, 8, 17, 40, 51))]

Query 1: State that has the highest potential customers.

In [ ]:
%%sql
SELECT state, sum(review_count) as review_count_state
FROM business_new as b
INNER JOIN categories_new_up as c
USING (business_id)
WHERE categories LIKE "%Restaurants%"
GROUP BY state
ORDER BY review_count_state DESC

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
19 rows affected.

[('PA', Decimal('1061273')),
 ('FL', Decimal('764107')),
 ('LA', Decimal('546019')),
 ('TN', Decimal('424553')),
 ('MO', Decimal('341544')),
 ('IN', Decimal('323986')),
 ('AZ', Decimal('255336')),
 ('NV', Decimal('232224')),
 ('CA', Decimal('206820')),
 ('NJ', Decimal('163973')),
 ('ID', Decimal('96543')),
 ('AB', Decimal('66414')),
 ('DE', Decimal('47146')),
 ('IL', Decimal('35320')),
 ('NC', Decimal('29')),
 ('HI', Decimal('17')),
 ('CO', Decimal('12')),
 ('MT', Decimal('6')),
 ('XMS', Decimal('5'))]

Inference:
Based on the review counts, Pennsylvania has the highest customer base. Therefore, we will proceed with that as the state we want to set up a restaurant in

QUERY 2: Top 10 cities having high potential customers in the state of Pennsylvania

In [ ]:
%%sql
SELECT b.city, sum(review_count) as review_count_city
FROM business_new AS b
INNER JOIN categories_new_up AS c
USING (business_id)
WHERE c.categories LIKE "%Restaurants%" AND state="PA"
GROUP BY b.city
ORDER BY review_count_city DESC
LIMIT 10;X

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
10 rows affected.

[('Philadelphia', Decimal('666241')),
 ('King of Prussia', Decimal('21251')),
 ('West Chester', Decimal('15737')),
 ('Wayne', Decimal('10749')),
 ('Media', Decimal('10333')),
 ('Conshohocken', Decimal('10194')),
 ('Ardmore', Decimal('10072')),
 ('New Hope', Decimal('9901')),
 ('Doylestown', Decimal('9344')),
 ('Bensalem', Decimal('8768'))]

Based on the review counts per city, Philadelphia has the highest customer base. Therefore, we will proceed with that as the city we want to set up a restaurant in

Query 3: In the city of Philadelphia, what are the counts of each cuisine's review

In [ ]:
%%sql
SELECT categories,SUM(review_count) AS rev_count
FROM business_new AS b
INNER JOIN categories_new_up AS c
USING (business_id)
WHERE c.categories IN ("Thai","Vietnamese","Indian","Chinese","Mexican","Barbeque","Japanese") AND city="Philadelphia"
GROUP BY categories
ORDER BY rev_count DESC

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
7 rows affected.

[('Japanese', Decimal('10907')),
 ('Mexican', Decimal('10557')),
 ('Chinese', Decimal('10357')),
 ('Thai', Decimal('6230')),
 ('Vietnamese', Decimal('4512')),
 ('Barbeque', Decimal('3511')),
 ('Indian', Decimal('3024'))]

Since Japanese Restaurants have the highest review count, it may indicate that the active customers like Japanese food most . So we will set up a restaurant with Japanese Cuisine

Query 4: The Japanese restaurants in Philadelphia with best ratings

In [ ]:
%%sql
SELECT b.business_id,b.name,b.address, b.stars
FROM business_new as b
JOIN categories_new_up as c ON b.business_id = c.business_id
WHERE b.city = 'Philadelphia'
AND c.categories = 'Japanese'
And b.stars >= 3.5
AND is_open=1
ORDER BY b.stars DESC
limit 10;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
10 rows affected.

[('0OsR9lO16jxa0xWUY57s9g', 'Koto Sushi', '719 Sansom St', 4.5),
 ('40O7uKX-uAG_JDrS-OM85w', 'Umai Umai', '533 N 22nd St', 4.5),
 ('6_T2xzR74JqGCTPefAD8Tw', 'Morimoto', '723 Chestnut St', 4.5),
 ('8LonS_bxNmCDk3FWiG9lzA', 'Tomo Sushi & Ramen', '228 Arch St', 4.5),
 ('H2c5e7PfcCg9f9Ew19-xRw', 'Sushi Poke', '1310 South St', 4.5),
 ('ngg445E-3otfqSqznafmxQ', 'Crack Crab', '2461 Grant Ave', 4.5),
 ('o7pgTVJqX2PYWbotk1uMug', 'Madame Saito - Queen of Sushi', '122 Lombard St', 4.5),
 ('RLtlS9CJlyGU3WIOLHxLwQ', 'Oishii', '138 Chestnut St', 4.5),
 ('Sv1MEZP-mMfp8SmE0hwYEA', 'Terakawa Ramen', '204 N 9th St', 4.5),
 ('vF9PBhB_5SrQHbCXtyYijA', 'Hibachi Shokudo', '1301 Vine St', 4.5)]

We want to choose the top competitors. So we list the restaurants that have gotten 4.5 star ratings. We can pay attention to these high-score restaurants andcan also learn from them.

Query 5: Restaurants receiving highest compliments from the users

In [ ]:
%%sql
SELECT name, SUM(compliment_count) as total_compliment
FROM business_new as b
JOIN categories_new_up as c ON b.business_id = c.business_id
INNER JOIN tips_new_up as t
ON b.business_id= t.business_id
WHERE b.city = 'Philadelphia'
AND c.categories = 'Japanese' AND stars=4.5 AND is_open=1
GROUP BY name
ORDER BY total_compliment DESC
LIMIT 3;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('Terakawa Ramen', Decimal('5')),
 ('Morimoto', Decimal('3')),
 ('Umai Umai', Decimal('1'))]

Now, we have finalized on our top competitors. We can start analysing the reviews for the given restaurants to get the specific information of these stores.

Query 6: The reviews for the restaurants receiving highest compliments from the users

In [ ]:
%%sql
SELECT DISTINCT review_id, b.business_id, name, funny, useful, text
FROM business_new as b
JOIN categories_new_up as c ON b.business_id = c.business_id
INNER JOIN yelp_rev_new_up as r
ON b.business_id= r.business_id
WHERE b.city = 'Philadelphia'
AND name="Terakawa Ramen"
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[('_pdb86xcgL-ys0DZAehBDw', 'qU04_z622p49wEIFB-9U5w', 'Terakawa Ramen', 0, 0, "Been here 3 times.  It's pretty close to original but original place tastes better.  Today's tan tan tasted a bit water down.  Their crispy chicken b ... (166 characters truncated) ... time.  Shame.  The white pepper really is the last zing it needs.  3 star for good effort and closeness to original. Minus 2 star for empty promises."),
 ('-GVUnskEs0oMQ_HHCxKvWQ', 'qU04_z622p49wEIFB-9U5w', 'Terakawa Ramen', 0, 1, "I tried Terakawa a year ago, and their ramen was so good that I want it everytime I come to Philly. \n\nCame back to it with some friends last month. ... (500 characters truncated) ... hing he enjoys. Many of their broths and/or noodles have both pork and chicken/veggie options, which open up many more options if you don't eat pork."),
 ('-QGnynYuaUfQ3L2I6WgoZQ', 'qU04_z622p49wEIFB-9U5w', 'Terakawa Ramen', 0, 0, 'Very tasty. Great service and practices great social distance measures to ensure a safe experience.'),
 ('-qNShmiYQZVQ2pZEU3TyZA', 'qU04_z622p49wEIFB-9U5w', 'Terakawa Ramen', 1, 3, '3.9/5\n\nThe ramen was enjoyable but not amazing or particularly memorable. A good spot for students, and a lively ambiance.'),
 ('0DtiGUfi7yGX03PIkm68VQ', 'qU04_z622p49wEIFB-9U5w', 'Terakawa Ramen', 1, 2, 'They finally opened for dine in!\n\n5/5 service. The workers here are always so friendly and attentive.\n\n4.5/5 food. Not the best but the top 5 jap ... (338 characters truncated) ... t going on and off when we were there so I did have to take a point off but other than that, it is a very clean and well decorated for casual dining!')]

Inference: Now we get the specific reviews. We noticed that there are some dishes mentioned by customers frequently, such as ramen, miso and sushi.

Query 7: Identify the number of times the word "ramen" is mentioned

In [ ]:
%%sql
SELECT name, COUNT(text) AS total_word_count
FROM business_new as b
JOIN categories_new_up as c ON b.business_id = c.business_id
INNER JOIN yelp_rev_new_up as r
ON b.business_id= r.business_id
WHERE b.city = 'Philadelphia'
AND name IN ("Terakawa Ramen","Morimoto","Umai Umai")
AND text LIKE "%ramen%"
GROUP BY name
ORDER BY total_word_count DESC
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
2 rows affected.

[('Terakawa Ramen', 11013), ('Morimoto', 630)]

Query 8: Identify the number of time the word "miso" is mentioned

In [ ]:
%%sql
SELECT name, COUNT(text) AS total_word_count_miso
FROM business_new as b
JOIN categories_new_up as c ON b.business_id = c.business_id
INNER JOIN yelp_rev_new_up as r
ON b.business_id= r.business_id
WHERE b.city = 'Philadelphia'
AND name IN ("Terakawa Ramen","Morimoto","Umai Umai")
AND text LIKE "%miso%"
GROUP BY name
ORDER BY total_word_count_miso DESC
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('Terakawa Ramen', 1638), ('Morimoto', 1224), ('Umai Umai', 96)]

Query 9: Identify the number of time the word "sushi" is mentioned

In [ ]:
%%sql
SELECT name, COUNT(text) AS total_word_count_miso
FROM business_new as b
JOIN categories_new_up as c ON b.business_id = c.business_id
INNER JOIN yelp_rev_new_up as r
ON b.business_id= r.business_id
WHERE b.city = 'Philadelphia'
AND name IN ("Terakawa Ramen","Morimoto","Umai Umai")
AND text LIKE "%sushi%"
GROUP BY name
ORDER BY total_word_count_miso DESC
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('Morimoto', 5718), ('Umai Umai', 1476), ('Terakawa Ramen', 91)]

Inference from Query 7-9: The 3 queries counted the number of mentions of common Japanese dishes. The information allow us to understand the dishes that reviewers interested in and our resturant can focus on the most popular dish which is **Ramen**

Query 10: Identify the opening hours in Terakawa Ramen

In [ ]:
%%sql
SELECT b.business_id, name,hours
FROM business_new AS b
INNER JOIN hour_new_up AS h
ON b.business_id=h.business_id
WHERE name="Terakawa Ramen"
AND b.city="Philadelphia"

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
7 rows affected.

[('qU04_z622p49wEIFB-9U5w', 'Terakawa Ramen', None),
 ('Sv1MEZP-mMfp8SmE0hwYEA', 'Terakawa Ramen', "'Tuesday': '11:30-22:0'"),
 ('Sv1MEZP-mMfp8SmE0hwYEA', 'Terakawa Ramen', " 'Wednesday': '11:30-22:0'"),
 ('Sv1MEZP-mMfp8SmE0hwYEA', 'Terakawa Ramen', " 'Thursday': '11:30-22:0'"),
 ('Sv1MEZP-mMfp8SmE0hwYEA', 'Terakawa Ramen', " 'Friday': '11:30-23:0'"),
 ('Sv1MEZP-mMfp8SmE0hwYEA', 'Terakawa Ramen', " 'Saturday': '11:30-23:0'"),
 ('Sv1MEZP-mMfp8SmE0hwYEA', 'Terakawa Ramen', " 'Sunday': '11:30-22:0'")]

Query 11: Identify the opening hours in Morimoto

In [ ]:
%%sql
SELECT b.business_id, name,hours
FROM business_new AS b
INNER JOIN hour_new_up AS h
ON b.business_id=h.business_id
WHERE name="Morimoto"
AND b.city="Philadelphia"

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
7 rows affected.

[('6_T2xzR74JqGCTPefAD8Tw', 'Morimoto', "'Monday': '0:0-0:0'"),
 ('6_T2xzR74JqGCTPefAD8Tw', 'Morimoto', " 'Tuesday': '17:0-22:0'"),
 ('6_T2xzR74JqGCTPefAD8Tw', 'Morimoto', " 'Wednesday': '17:0-22:0'"),
 ('6_T2xzR74JqGCTPefAD8Tw', 'Morimoto', " 'Thursday': '17:0-22:0'"),
 ('6_T2xzR74JqGCTPefAD8Tw', 'Morimoto', " 'Friday': '16:0-21:0'"),
 ('6_T2xzR74JqGCTPefAD8Tw', 'Morimoto', " 'Saturday': '17:0-23:0'"),
 ('6_T2xzR74JqGCTPefAD8Tw', 'Morimoto', " 'Sunday': '17:0-22:0'")]

Query 12: Identify the opening hours in Umai Umai

In [ ]:
%%sql
SELECT b.business_id, name,hours
FROM business_new AS b
INNER JOIN hour_new_up AS h
ON b.business_id=h.business_id
WHERE name="Umai Umai"
AND b.city="Philadelphia"

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
7 rows affected.

[('40O7uKX-uAG_JDrS-OM85w', 'Umai Umai', "'Monday': '0:0-0:0'"),
 ('40O7uKX-uAG_JDrS-OM85w', 'Umai Umai', " 'Tuesday': '17:0-21:30'"),
 ('40O7uKX-uAG_JDrS-OM85w', 'Umai Umai', " 'Wednesday': '17:0-21:30'"),
 ('40O7uKX-uAG_JDrS-OM85w', 'Umai Umai', " 'Thursday': '17:0-21:30'"),
 ('40O7uKX-uAG_JDrS-OM85w', 'Umai Umai', " 'Friday': '17:0-22:30'"),
 ('40O7uKX-uAG_JDrS-OM85w', 'Umai Umai', " 'Saturday': '17:0-22:30'"),
 ('40O7uKX-uAG_JDrS-OM85w', 'Umai Umai', " 'Sunday': '17:0-21:30'")]

Inference from Query 10-12: The 3 queries exhibit the opening hours of our 3 competitors. From the result, we take the time that would cover all opening hours which is Monday to Sunday 11:30am - 23:00pm

**Final Conclusion**: Based on the query results, we are planning to open a restaurant in Philadelphia, PA, specializing in Japanese cuisine, with a primary focus on ramen as the main dish. Our intended operating hours will be from Monday to Sunday, opening at 11:30 AM and closing at 11:00 PM.